spec/vcr_cassettes/cba_current.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.cba.am/exchangerates.asmx
    body:
      encoding: UTF-8
      string: |
        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                       xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                       xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <ExchangeRatesLatest xmlns="http://www.cba.am/" />
          </soap:Body>
        </soap:Envelope>
    headers:
      Content-Type:
      - text/xml; charset=utf-8
      Soapaction:
      - '"http://www.cba.am/ExchangeRatesLatest"'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
      User-Agent:
      - Ruby
      Host:
      - api.cba.am
  response:
    status:
      code: 200
      message: OK
    headers:
      Cache-Control:
      - private, max-age=0
      Content-Type:
      - text/xml; charset=utf-8
      Server:
      - Microsoft-IIS/10.0
      X-Aspnet-Version:
      - 4.0.30319
      X-Powered-By:
      - ASP.NET
      Date:
      - Tue, 17 Mar 2026 15:06:36 GMT
      Content-Length:
      - '3859'
    body:
      encoding: UTF-8
      string: <?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
        xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><soap:Body><ExchangeRatesLatestResponse
        xmlns="http://www.cba.am/"><ExchangeRatesLatestResult><CurrentDate>2026-03-17T00:00:00</CurrentDate><NextAvailableDate
        xsi:nil="true" /><PreviousAvailableDate>2026-03-16T00:00:00</PreviousAvailableDate><Rates><ExchangeRate><ISO>USD</ISO><Amount>1</Amount><Rate>377.46</Rate><Difference>0.05</Difference></ExchangeRate><ExchangeRate><ISO>GBP</ISO><Amount>1</Amount><Rate>502.89</Rate><Difference>2.1</Difference></ExchangeRate><ExchangeRate><ISO>AUD</ISO><Amount>1</Amount><Rate>267.43</Rate><Difference>1.43</Difference></ExchangeRate><ExchangeRate><ISO>EUR</ISO><Amount>1</Amount><Rate>434.27</Rate><Difference>1.31</Difference></ExchangeRate><ExchangeRate><ISO>XDR</ISO><Amount>1</Amount><Rate>512.83</Rate><Difference>0.33</Difference></ExchangeRate><ExchangeRate><ISO>IRR</ISO><Amount>100</Amount><Rate>0.028598</Rate><Difference>-0.000013</Difference></ExchangeRate><ExchangeRate><ISO>PLN</ISO><Amount>1</Amount><Rate>101.82</Rate><Difference>0.25</Difference></ExchangeRate><ExchangeRate><ISO>CAD</ISO><Amount>1</Amount><Rate>275.52</Rate><Difference>-0.12</Difference></ExchangeRate><ExchangeRate><ISO>INR</ISO><Amount>1</Amount><Rate>4.0825</Rate><Difference>-0.0022</Difference></ExchangeRate><ExchangeRate><ISO>NOK</ISO><Amount>1</Amount><Rate>39.185</Rate><Difference>0.323</Difference></ExchangeRate><ExchangeRate><ISO>JPY</ISO><Amount>10</Amount><Rate>23.72</Rate><Difference>0.019</Difference></ExchangeRate><ExchangeRate><ISO>SEK</ISO><Amount>1</Amount><Rate>40.502</Rate><Difference>0.272</Difference></ExchangeRate><ExchangeRate><ISO>CHF</ISO><Amount>1</Amount><Rate>479.68</Rate><Difference>0.92</Difference></ExchangeRate><ExchangeRate><ISO>CZK</ISO><Amount>1</Amount><Rate>17.76</Rate><Difference>0.035</Difference></ExchangeRate><ExchangeRate><ISO>CNY</ISO><Amount>1</Amount><Rate>54.792</Rate><Difference>0.031</Difference></ExchangeRate><ExchangeRate><ISO>SGD</ISO><Amount>1</Amount><Rate>295.31</Rate><Difference>0.25</Difference></ExchangeRate><ExchangeRate><ISO>BRL</ISO><Amount>1</Amount><Rate>72.16</Rate><Difference>1.268</Difference></ExchangeRate><ExchangeRate><ISO>AED</ISO><Amount>1</Amount><Rate>102.76</Rate><Difference>0.01</Difference></ExchangeRate><ExchangeRate><ISO>KGS</ISO><Amount>1</Amount><Rate>4.3228</Rate><Difference>0.0059</Difference></ExchangeRate><ExchangeRate><ISO>KZT</ISO><Amount>10</Amount><Rate>7.8562</Rate><Difference>0.0551</Difference></ExchangeRate><ExchangeRate><ISO>RUB</ISO><Amount>1</Amount><Rate>4.5869</Rate><Difference>-0.0702</Difference></ExchangeRate><ExchangeRate><ISO>UAH</ISO><Amount>1</Amount><Rate>8.5845</Rate><Difference>0.0233</Difference></ExchangeRate><ExchangeRate><ISO>UZS</ISO><Amount>10</Amount><Rate>0.31073</Rate><Difference>-0.00118</Difference></ExchangeRate><ExchangeRate><ISO>BYN</ISO><Amount>1</Amount><Rate>128.11</Rate><Difference>-0.56</Difference></ExchangeRate><ExchangeRate><ISO>TJS</ISO><Amount>1</Amount><Rate>39.277</Rate><Difference>-0.009</Difference></ExchangeRate><ExchangeRate><ISO>GEL</ISO><Amount>1</Amount><Rate>138.74</Rate><Difference>0.55</Difference></ExchangeRate><ExchangeRate><ISO>HKD</ISO><Amount>1</Amount><Rate>48.167</Rate><Difference>-0.029</Difference></ExchangeRate><ExchangeRate><ISO>XAU</ISO><Amount>1</Amount><Rate>60616</Rate><Difference>-595</Difference></ExchangeRate><ExchangeRate><ISO>XAG</ISO><Amount>1</Amount><Rate>958.05</Rate><Difference>-57.55</Difference></ExchangeRate><ExchangeRate><ISO>NZD</ISO><Amount>1</Amount><Rate>220.32</Rate><Difference>-0.01</Difference></ExchangeRate></Rates></ExchangeRatesLatestResult></ExchangeRatesLatestResponse></soap:Body></soap:Envelope>
  recorded_at: Tue, 17 Mar 2026 15:06:36 GMT
recorded_with: VCR 6.4.0
